export const BASE_URL = process.env.NEXT_PUBLIC_API_URL;
type FAQItem = {
  id: number;
  question: string;
  answer: string;
};

export const faqData: FAQItem[] = [
  {
    id: 1,
    question: 'Որքա՞ն է վեբ հրավիրատոմսի արժեքը',
    answer:
      'Մեզ մոտ վեբ հրավիրատոմսերը սկսվում են 14900 դրամից. Գրեթե միշտ ունենք հատուկ առաջարկներ ու զեղչեր',
  },
  {
    id: 2,
    question: 'Որքա՞ն ժամանակում կստանամ վեբ հրավիրատոմսը',
    answer: 'Ձեր առիթի վեբ հրավիրատոմսը պատրաստ է լինում 1-2 օրվա ընթացքում',
  },
  {
    id: 3,
    question: 'Վեբ հրավիրատոմս ստեղծելու համար ի՞նչ տվյալներ են անհրաժեշտ',
    answer:
      'Անհրաժեշտ են հետևյալ տվյալները․\n • Միջոցառման անունը\n • Ամսաթիվ և ժամ \n • Վայրը (հասցե կամ Google Maps հղում) \n • Ողջույնի խոսք կամ հրավերքի տեքստ  \n • Լուսանկար(ներ) ցանկության դեպքում',
  },
  {
    id: 4,
    question:
      'Կարո՞ղ ենք ժամանակի ընթացքում փոփոխություններ կատարել վեբ հրավիրատոմսի վրա',
    answer:
      'Այո, վեբ հրավիրատոմսում կարող եք փոքր փոփոխություններ անել նաև պատրաստվելուց հետո՝ օրինակ՝ ժամի կամ հասցեի փոփոխություն։ Խոշոր փոփոխությունների դեպքում գուցե պահանջվի լրացուցիչ ժամանակ',
  },
  {
    id: 5,
    question: 'Ի՞նչ առիթների համար եք պատրաստում հրավիրատոմսեր',
    answer:
      'Մենք ստեղծում ենք հիշարժան և ոճային հրավիրատոմսեր՝ հարսանիքների, մկրտությունների, ծննդյան տոների և այլ միջոցառումների համար',
  },
];

export const mockTemplateDesign = {
  maleName: 'Հովհաննես',
  femaleName: 'Աննա',
  eventDate: '2025-09-01',
  placeName: 'Հայաստան, Երևան',
  churchName: 'Սուրբ Գրիգոր Լուսավորիչ',
  eventProgram: [
    {
      eventName: 'Ամուսնության արարողություն',
      eventTime: '12:00',
      eventPlace: 'Եկեղեցի',
    },
    {
      eventName: 'Ընդունելություն',
      eventTime: '14:00',
      eventPlace: 'Ռեստորան',
    },
  ],
  introDescription: 'Հարսանիքի գեղեցիկ օր է, որին բոլորն են սպասում։',
  hasDressCode: true,
  dressCodeColors: ['Կարմիր', 'Սև'],
  hasMusic: true,
  musicSource: '/mock-music.mp3',
};
